Repository: bcrowell/opengrade
Catalog: i18n/*.po
Languages: ru, uk

source: Student:
ru: Студент:
uk: Студент:

source: Assignment:
ru: Задание:
uk: Завдання:

source: Grade:
ru: Оценка:
uk: Оцінка:

source: Open Gradebook
ru: Открыть журнал успеваемости
uk: Відкрити клясний журнал

source: Summary of Changes
ru: Сводка изменений
uk: Зведення змін

source: File to Change
ru: Файл для изменения
uk: Файл для змінювання

source: File to Fold In
ru: Файл для сложения
uk: Файл для складання

source: The grade for %s on %s is %s. Change it to %s?
ru: Оценка для %s на %s является %s. Изменить её на %s?
uk: Оцінка для %s на %s є %s. Змінити її на %s?

source: Yes
ru: Да
uk: Так

source: No
ru: Нет
uk: Ні

source: New password
ru: Новый пароль
uk: Новий пароль

source: Filename
ru: Имя файла
uk: Ім’я файлу

source: New File
ru: Новый файл
uk: Новий файл

source: The file %s already exists.
ru: Файл %s уже существует.
uk: Файл %s вже існує.

source: Your file has been created. You might want to use the File menu now to set your grading standards, and the Server menu to set yourself up to let students view their grades on the web. You will also need to use the Assignments menu to create categories (exams, homework, etc.) and make assignments within those categories. And of course you have students! You can put in their names using the Students menu.
ru: Ваш файл был создан. Теперь вы можете использовать меню Файл, чтобы установить ваши стандарты оценивания, и меню сервера, чтобы установить себя, позволив студентам смотреть свои оценки в Интернете. Вам также нужно использовать меню Заданий, чтобы создать категории (экзамены, домашние задания, и т.д.) и назначить задания в пределах этих категорий. И, конечно, у вас есть студенты! Вы можете поместить их имена, пользуясь меню Студентов.
uk: Ваш файл було створено. Тепер Ви можете використовувати меню Файл, щоб встановити Ваші стандарти оцінювання, та меню сервера, щоб встановити себе, дозволивши студентам дивитися свої оцінки в Інтернеті. Вам також потрібно використовувати меню Завдань, щоб створити категорії (іспити, домашні завдання, тощо.) й призначити завдання у межах цих категорій. Й, звісно, у Вас є студенти! Ви можете помістити їх імена, користуючись меню Студентів.

source: Delete an Entire Category
ru: Удалить всю категорию
uk: Вилучити усю категорію

source: You are asking to delete the entire category %s, which contains %s %s. Are you sure you want to do this?
ru: Вас спрашивают удалить ли всю категорию %s, которая содержит %s %s. Вы уверены, что хотите это сделать?
uk: Вас питають чи вилучити усю категорію %s, яка містить %s %s. Ви впевнені, що волієте це зробити?

source: Editing Category Weights
ru: Редактирование весов категорий
uk: Редагування вагів категорій

source: This gradebook has been set up using point-total grading, not weighted grading.
ru: Этот журнал успеваемости был создан, используя полностью точечное оценивание, не взвешенное оценивание.
uk: Цей клясний журнал був створений, використовуючи повністю точкове оцінювання, не зважене оцінювання.

source: This gradebook doesn't yet have any categories.
ru: Этот журнал успеваемости ещё не имеет категорий.
uk: Цей клясний журнал ще не має категорій.

source: Weight for %s
ru: Вес для %s
uk: Вага для %s

source: This is a single-assignment category, and it already has an assignment in it.
ru: Это однозадачная категория, и в ней уже есть задание.
uk: Це однозадачна категорія, й в ній вже є завдання.

source: The assignment %s already exists in category %s.
ru: Задание %s уже существует в категории %s.
uk: Завдання %s вже існує в категорії %s.

source: Number or name
ru: Число или имя
uk: Число або ім’я

source: Maximum score
ru: Максимальный балл
uk: Максимальна оцінка

source: Due date (optional)
ru: Срок (опционально)
uk: Термін (опційно)

source: Grade Must Be Numeric
ru: Оценка должна быть числом
uk: Оцінка повинна бути числом

source: Grades must be numeric.
ru: Оценка должна быть числом.
uk: Оцінка повинна бути числом.

source: Score Greater Than Maximum
ru: Балл больше максимального
uk: Оцінка більша максимальної

source: The score of %s for %s on %s is greater than the maximum of %s. To confirm this score, hit OK. To restore this score to its previous value, hit cancel. To correct this score, enter the corrected value and hit OK. To avoid this warning in the future, you can enter a greater-than-maximum score with an x on the end, e.g., 105x.
ru: Балл из %s для %s на %s больше, чем максимум %s. Чтобы подтвердить этот балл, нажмите ОК. Для восстановления этого балла к своему предыдущему значению, нажмите Отмену. Чтобы исправить этот балл, введите скорректированное значение и нажмите кнопку ОК. Чтобы избежать этого предупреждения в будущем, вы можете ввести больше, чем максимальный балл с х на конце, например, 105x.
uk: Оцінка із %s для %s на %s більше, ніж максимум %s. Щоб підтвердити цю оцінку, натисніть ТАК. Для відновлення цієї оцінки до свого попереднього значення, натисніть Скасувати. Щоб виправити цю оцінку, уведіть скориговане значення й натисніть кнопку ТАК. Щоб уникнути цього попередження у майбутньому, Ви можете увести більше, ніж максимальну оцінку з х на кінці, наприклад, 105x.

source: Which marking period?
ru: Какой период маркировать?
uk: Який період маркувати?

source: All marking periods
ru: Все промаркированные периоды
uk: Усі промарковані періоди

source: Class Statistics
ru: Статистика класса
uk: Статистика кляси

source: Report: Overall Grade
ru: Отчёт: Оценка в целом
uk: Звіт: Оцінка загалом

source: Report: Averages in a Category
ru: Отчёт: Среднее в категории
uk: Звіт: Середнє в категорії

source: Report: Scores on an Assignment
ru: Отчёт: Баллы за задание
uk: Звіт: Оцінки за завдання

source: Report: Statistics For an Assignment
ru: Отчёт: Статистика для задания
uk: Звіт: Статистика для завдання

source: Sort by score
ru: Сортировать по баллу
uk: Сортувати за оцінкою

source: Sort by name
ru: Сортировать по имени
uk: Сортувати за ім’ям

source: Print Graphical Version
ru: Напечатать графическую версию
uk: Надрукувати графічну версію

source: Save Graphical Version as PDF
ru: Сохранить графическую версию в PDF
uk: Зберегти графічну версію в PDF

source: Weighting mode
ru: Режим измерения веса
uk: Режим виміру ваги

source: straight points
ru: ровные точки
uk: рівні крапки

source: weighted
ru: взвешенно
uk: зважено

source: not defined, because no categories have been set up yet
ru: не определено, потому что ещё не было установлено категорий
uk: не визначено, бо ще не було встановлено категорій

source: Marking periods
ru: Маркировка периодов
uk: Маркування періодів

source: Cloning a File
ru: Клонировать файл
uk: Клонувати файл

source: Please enter a description of the class, to appear at the top of reports.
ru: Пожалуйста, введите описание класса, появляющееся в верхней части отчётов.
uk: Будь ласка, уведіть опис кляси, що з’являється у верхній частині звітів.

source: Please enter the days of the week on which the class meets, using R for Thursday, and U for Sunday. Supplying accurate information here will make it quicker for you to enter due dates. If the class doesn't meet on definite days of the week, just leave it blank to accept the default, which is MTWRF.
ru: Пожалуйста, введите дни недели, в которые класс встречается, используя R для четверга и U для воскресенья. Указание точной информации здесь ускорит вам ввод сроков. Если класс не встречается в определённые дни недели, просто оставьте это поле пустым, чтобы принять значение по умолчанию, то есть MTWRF.
uk: Будь ласка, уведіть дні тижня, у які кляса зустрічається, використовуючи R для четверга й U для неділі. Вказування точної інформації тут пришвидшить Вам ввід термінів. Якщо кляса не зустрічається у певні дні тижня, просто залиште це поле порожнім, щоб прийняти типове значення, тобто MTWRF.

source: Please enter the time the class meets, in 24-hour hh:mm format. For example, if it meets at 1:30 in the afternoon, enter 13:30. It's OK if you leave this blank.
ru: Пожалуйста, введите время встреч класса в 24-часовом формате чч:мм. Например, если встречи в 1:30 во второй половине дня, то введите 13:30. Это нормально, если вы оставите здесь пусто.
uk: Будь ласка, уведіть час зустрічей кляси у 24-годинному форматі гг:хх. Наприклад, якщо зустрічі в 1:30 у другій половині дня, то уведіть 13:30. Це нормально, якщо Ви залишите тут порожньо.

source: Please enter the calendar year during which the term started.
ru: Пожалуйста, введите календарный год, в течение которого начат семестр.
uk: Будь ласка, уведіть календарний рік, протягом якого почато семестр.

source: Please enter the number of the month (1-12) in which the term started.
ru: Пожалуйста, введите номер месяца (1-12), в котором начат семестр.
uk: Будь ласка, уведіть номер місяця (1-12), у якому почато семестр.

source: Please enter a password that you will use for authentication. You will need to enter this password whenever you open this file. The password can be blank if you don't want to remember a real one.
ru: Пожалуйста, введите пароль, который вы будете использовать для аутентификации. Вам потребуется вводить этот пароль каждый раз, когда вы открываете этот файл. Пароль может быть пустым, если вы не хотите запоминать реальный пароль.
uk: Будь ласка, уведіть пароль, який Ви будете використовувати для автентифікації. Вам знадобиться уводити цей пароль щораз, коли Ви відкриваєте цей файл. Пароль може бути порожнім, якщо Ви не бажаєте запам’ятовувати реальний пароль.

source: If you will be posting students' grades on a server using Spotter, please enter the subdirectory for the class.
ru: Если вы будете размещать оценки учащихся на сервере, используя Spotter, то пожалуйста, введите подкаталог для класса.
uk: Якщо Ви будете розміщувати оцінки учнів на сервері, використовуючи Spotter, то будь ласка, уведіть підкаталог для кляси.

source: Format
ru: Формат
uk: Формат

source: For Online Grades format, make sure you have the right options set up in Settings under the Online Grades menu. To make the Online Grades menu appear, use the Preferences menu and restart OpenGrade.
ru: Для формата онлайн оценок убедитесь, что у вас использованы правильные опции, установленные в настройках в меню онлайн оценок. Для того, чтобы меню онлайн оценок появилось, используйте меню Настроек и перезагрузите OpenGrade.
uk: Для формату онлайн оцінок переконайтеся, що в Вас використані правильні опції, встановлені у налаштуваннях в меню онлайн оцінок. Для того, щоб меню онлайн оцінок з’явилося, використовуйте меню Налаштувань і перезавантажте OpenGrade.

source: The web server gave an error. The file ServerOG.log on the server has more detailed information on the error, which is not revealed here for security reasons. If the error is incorrect_password_or_server_key, then either the server key or the password is wrong. For the server key, you can check against the file YOURNAME.instructor_info on the server and make sure that it is the same as the value set in the Spotter menu under Client/Server Settings. The password you used to open this gradebook file must also match the one in the .instructor_info file. (Actually the password itself is not stored in that file; only a hash of the password is stored there.) For documentation on this kind of thing, see the Spotter documentation, under "Interfacing."
ru: Веб-сервер выдал ошибку. Файл ServerOG.log на сервере имеет более подробную информацию об ошибке, которая не показана здесь по соображениям безопасности. Если ошибка incorrect_password_or_server_key, то либо ключ сервера, либо неверный пароль. Для ключа сервера вы можете проверить файл YOURNAME.instructor_info на сервере и убедиться, что он такой же, как и значение, установленное в меню Spotter под параметрами клиента/сервера. Пароль, используемый вами для открытия этого файла журнала успеваемости, должен также соответствовать паролю в файле .instructor_info. (На самом деле сам пароль не хранится в этом файле; только хеш пароля хранится там.) Для документации на такого рода вещи обратитесь к документации Spotter, под "Интерфейсом."
uk: Веб-сервер видав помилку. Файл ServerOG.log на сервері має більш докладну інформацію про помилку, яка не показана тут з міркувань безпеки. Якщо помилка incorrect_password_or_server_key, то або ключ сервера, або невірний пароль. Для ключа сервера Ви можете перевірити файл YOURNAME.instructor_info на сервері й переконатися, що він такий самий, як і значення, встановлене у меню Spotter під параметрами клієнта/сервера. Пароль, вживаний Вами для відкриття цього файлу клясного журналу, повинен також відповідати паролю у файлі .instructor_info. (Насправді сам пароль не зберігається у цьому файлі; лише хеш паролю зберігається там.) Для документації на такого роду речі зверніться до документації Spotter, під "Інтерфейсом."

source: Broadcast a message to the whole class -- are you sure?
ru: Трансляция сообщения для целого класса -- вы уверены?
uk: Транслювання повідомлення для цілої кляси-- Ви впевнені?

source: Deactivate Account
ru: Деактивировать аккаунт
uk: Деактивувати обліковий запис

source: to
ru: к
uk: до

source: send e-mail?
ru: отправить почту?
uk: відправити пошту?

source: subject
ru: предмет
uk: предмет

source: body
ru: тело
uk: тіло

source: You must set the server key. This is done through Client/Server Settings in the Spotter menu.
ru: Вы должны установить ключ сервера. Это делается с помощью настройки клиента/сервера в Меню Spotter.
uk: Ви повинні встановити ключ сервера. Це здійснюється за допомогою налаштування клієнта/сервера в Меню Spotter.

source: There was an error connecting to the server.
ru: Случилась ошибка подключения к серверу.
uk: Сталася помилка під’єднання до сервера.

source: yes
ru: да
uk: так

source: no
ru: нет
uk: ні

source: Grade Symbols
ru: Символы оценок
uk: Символи оцінок

source: Minimum Percentages
ru: Минимальные проценты
uk: Мінімальні відсотки

source: Custom: Enter a series of symbols separated by spaces, in order from highest to lowest. At the end, you must include a grade symbol that is the lowest of all, requiring zero percent to attain.
ru: Пользовательское: Введите серию символов, разделённых пробелами, в порядке от высшего к низшему. В конце вы должны включить символ оценки, который является самым низким из всех, требуя ноль процентов для достижения.
uk: Користувацьке: Уведіть серію символів, розділених пробілами, у порядку від вищого до нижчого. У кінці Ви повинні включити символ оцінки, який є найнижчим з усіх, вимагаючи нуль відсотків для досягнення.

source: You must have at least two grade symbols.
ru: У вас должно быть по крайней мере два символа оценки.
uk: В Вас має бути принаймні два символи оцінки.

source: Too many grade symbols.
ru: Слишком много символов оценки.
uk: Забагато символів оцінки.

source: All grade symbols must be unique.
ru: Все символы оценки должны быть уникальными.
uk: Усі символи оцінки повинні бути унікальними.

source: Percentages must be in descending order, and must not be the same.
ru: Проценты должны быть в порядке убывания и не должны быть идентичны.
uk: Відсотки повинні бути у порядку спадання й не повинні бути однакові.

source: Name of marking period %s
ru: Имя промаркированного периода %s
uk: Ім’я промаркованого періоду %s

source: Starting date of marking period %s
ru: Начальная дата промаркированного периода %s
uk: Початкова дата промаркованого періоду %s

source: Please enter the username you'll use on the server.
ru: Пожалуйста, введите имя пользователя, которое будет использоваться на сервере.
uk: Будь ласка, уведіть ім’я користувача, яке буде використовуватися на сервері.

source: Please enter account you'll use on the server.
ru: Пожалуйста, введите аккаунт, который будет использоваться на сервере.
uk: Будь ласка, уведіть обліковий запис, який буде використовуватися на сервері.

source: Please enter the name of the server, e.g., myserver.edu.
ru: Пожалуйста, введите имя сервера, например, myserver.edu.
uk: Будь ласка, уведіть ім’я сервера, наприклад, myserver.edu.

source: Please enter the subdirectory for the class, e.g., f2002/205.
ru: Пожалуйста, введите подкаталог для класса, например, f2002/205.
uk: Будь ласка, уведіть підкаталог для кляси, наприклад, f2002/205.

source: Please enter the server key.
ru: Пожалуйста, введите ключ сервера.
uk: Будь ласка, уведіть ключ сервера.

source: Please enter the location of the cgi-bin on your server.
ru: Пожалуйста, введите расположение cgi-bin на сервере.
uk: Будь ласка, уведіть розташування cgi-bin на сервері.

source: Please enter the class's subdirectory, relative to cgi-bin. This is typically of the form spotter/username/term/course.
ru: Пожалуйста, введите подкаталог класса, привязанный к cgi-bin. Это, как правило, форма spotter/имя пользователя /семестр/курс.
uk: Будь ласка, уведіть підкаталог кляси, прив’язаний до cgi-bin. Зазвичай це, форма spotter/ім’я користувача /семестр/курс.

source: Settings for Online Grades
ru: Настройки для онлайн оценок
uk: Налаштування для онлайн оцінок

source: Server
ru: Сервер
uk: Сервер

source: Title of course
ru: Название курса
uk: Назва курсу

source: Username or email address
ru: Имя пользователя или адрес почты
uk: Ім’я користувача або адреса пошти

source: Course code
ru: Код курса
uk: Код курсу

source: Section number
ru: Номер секции
uk: Номер секції

source: Teacher's name to display on reports, e.g., Ms. Smith
ru: Имя учителя для отображения в отчётах, например, г-жа Смит
uk: Ім’я вчителя для показу у звітах, наприклад, пані Сміт

source: Term
ru: Семестр
uk: Семестр

source: Text to display regarding the class
ru: Текст для отображения в отношении класса
uk: Текст для відображення у відношенні кляси

source: Period (optional)
ru: Период (опционально)
uk: Період (опційно)

source: Phone number (optional)
ru: Номер телефона (опционально)
uk: Номер телефону (опційно)

source: Enter a constant to add onto all font sizes. For example, if you enter 2, all font sizes will be increased by 2.
ru: Введите константу, добавляемую на все размеры шрифта. Например, если ввести 2, то все размеры шрифтов будут увеличены на 2.
uk: Уведіть константу, що буде долучатися на усі розміри шрифту. Наприклад, якщо увести 2, то усі розміри шрифтів будуть збільшені на 2.

source: Do you want OpenGrade to beep at you?
ru: Вы хотите чтобы OpenGrade издавал звуковой сигнал на вас?
uk: Ви бажаєте щоб OpenGrade видавав звуковий сигнал на Вас?

source: Do you want grades left-justified, or right-justified?
ru: Вы хотите оценки, выровненные влево или вправо?
uk: Ви бажаєте оцінки, вирівняні вліво або вправо?

source: Enter the Unix shell command you want to use for opening a text file in an external editor, e.g., gedit.
ru: Введите команду оболочки Unix, которую вы хотите использовать для открытия текстового файла во внешнем редакторе, например, gedit.
uk: Уведіть команду оболонки Unix, яку Ви волієте використовувати для відкриття текстового файлу у зовнішньому редакторі, наприклад, gedit.

source: Enter the Unix shell command you want to use to print a text file, e.g., lpr -o page-left=40 -o page-right=36 -o page-top=100 -o page-bottom=36.
ru: Введите команду оболочки Unix, которую вы хотите использовать для печати текстового файла, например, lpr -o page-left=40 -o page-right=36 -o page-top=100 -o page-bottom=36.
uk: Уведіть команду оболонки Unix, яку Ви бажаєте використовувати для друку текстового файлу, наприклад, lpr -o page-left=40 -o page-right=36 -o page-top=100 -o page-bottom=36.

source: Enter the Unix shell command you want to use to open a spreadsheet file, e.g., soffice -calc.
ru: Введите команду оболочки Unix, которую вы хотите использовать для открытия файла электронной таблицы, например, soffice -calc.
uk: Уведіть команду оболонки Unix, яку Ви бажаєте використовувати для відкриття файлу електронної таблиці, наприклад, soffice -calc.

source: You can set the cryptographic algorithm used for creating the digital watermarks in gradebook files. SHA1 is automatically supported if you install OpenGrade with all its dependencies, but weaknesses in the SHA1 algorithm have been showing up, leading to the possibility of forgery at some point in the future. Whirlpool is also automatically supported if you install OpenGrade with all its dependencies, but will be slow unless you also install the Digest::Whirlpool module from CPAN.
ru: Вы можете установить криптографический алгоритм, используемый для создания водяных знаков в цифровых файлах журнала успеваемости. SHA1 поддерживается автоматически, если вы установите OpenGrade со всеми его зависимостями, но есть недостатки в алгоритме SHA1, что приводит к возможности подделки в какой-то момент в будущем. Whirlpool также автоматически поддерживается, если вы установите OpenGrade со всеми его зависимостями, но будет медленным, пока вы не установите модуль Digest::Whirlpool из CPAN.
uk: Ви можете встановити криптографічний алгоритм, вживаний для створення водяних знаків у цифрових файлах клясного журналу. SHA1 підтримується автоматично, якщо Ви встановите OpenGrade з усіма його залежностями, але є недоліки в алгоритмі SHA1, що призводить до можливости підробки у якусь мить в майбутньому. Whirlpool також автоматично підтримується, якщо Ви встановите OpenGrade з усіма його залежностями, але буде повільним, поки Ви не встановите модуль Digest::Whirlpool із CPAN.

source: to enter grades on an assignment, in alphabetical order,
ru: ввести оценки для заданий в алфавитном порядке,
uk: увести оцінки для завдань в абетковому порядку,

source: to enter grades on an assignment, selecting one student at a time,
ru: ввести оценки для заданий, выбирая одного студента за раз,
uk: увести оцінки для завдань, вибираючи одного студента за раз,

source: to edit the roster or the list of categories,
ru: редактировать реестр или список категорий,
uk: редагувати реєстр або перелік категорій,

source: for reports,
ru: для отчётов,
uk: для звітів,

source: to upload grades,
ru: выгрузить оценки,
uk: вивантажити оцінки,

source: to save and close this file
ru: сохранить и закрыть этот файл
uk: зберегти та закрити цей файл

source: to close this file,
ru: закрыть этот файл,
uk: закрити цей файл,

source: to save this file
ru: сохранить этот файл
uk: зберегти цей файл

source: (not necessary, because it has not been modified)
ru: (нет необходимости, так как он не был изменён)
uk: (немає необхідності, оскільки він не був змінений)

source: to close this file without saving it,
ru: закрыть этот файл без его сохранения,
uk: закрити цей файл без його збереження,

source: to create a new file,
ru: создать новый файл,
uk: створити новий файл,

source: to open a file,
ru: открыть файл,
uk: відкрити файл,

source: to quit.
ru: выйти.
uk: вийти.

source: to save this file and quit.
ru: сохранить этот файл и выйти.
uk: зберегти цей файл і вийти.

source: user
ru: пользователь
uk: користувач

source: date
ru: дата
uk: дата

source: Main menu --- enter
ru: Главное меню --- ввод
uk: Головне меню --- ввід

source: Writing file.
ru: Записывается файл.
uk: Записується файл.

source: Enter the name of the gradebook file to open.
ru: Введите имя файла журнала успеваемости для открытия
uk: Уведіть ім’я файлу клясного журналу для відкриття

source: Done.
ru: Завершено.
uk: Завершено.

source: Edit menu --- enter
ru: Меню редактирования --- ввод
uk: Меню редагування --- ввід

source: to edit categories,
ru: редактировать категории,
uk: редагувати категорії,

source: to edit students,
ru: редактировать студентов,
uk: редагувати студентів,

source: - or m to return to the main menu.
ru: - или m для возврата в главное меню.
uk: - або m для повернення у головне меню.

source: Edit Category
ru: Редактировать категорию
uk: Редагувати категорію

source: to add a new category,
ru: добавить новую категорию,
uk: додати нову категорію,

source: to go back to the edit menu,
ru: вернуться к меню редактирования,
uk: повернутися до меню редагування,
