Repository: bcrowell/opengrade
Catalog: i18n/*.po
Languages: ru, uk

source: A blank value is not allowed.
ru: Пустое значение не допускается.
uk: Порожнє значення не дозволяється.

source: The minimum value is %s.
ru: Минимальное значение %s.
uk: Мінімальне значення %s.

source: The maximum value is %s.
ru: Максимальное значение %s.
uk: Максимальне значення %s.

source: Times must be in the format h:mm or hh:mm.
ru: Времена должны быть в формате ч:мм или чч:мм.
uk: Часи повинні бути у форматі г:хх або гг:хх.

source: Illegal date format: %s. Dates must be in the format month-day or year-month-day. Years, if supplied, must be four digits.
ru: Недопустимый формат даты: %s. Даты должны быть в формате месяц-день или год-месяц-день. Годы, если имеются, должны иметь четыре цифры.
uk: Неприпустимий формат дати: %s. Дати повинні бути у форматі місяць-день або рік-місяць-день. Роки, якщо є, повинні мати чотири цифри.

source: Illegal hour or minute.
ru: Недопустимый час или минута.
uk: Неприпустима година або хвилина.

source: Illegal month or day: %s. Dates must be in the format month-day or year-month-day. Years, if supplied, must be four digits.
ru: Недопустимый месяц или день: %s. Даты должны быть в формате месяц-день или год-месяц-день. Годы, если имеются, должны иметь четыре цифры.
uk: Неприпустимий місяць або день: %s. Дати повинні бути у форматі місяць-день або рік-місяць-день. Роки, якщо є, повинні мати чотири цифри.

source: none
ru: пусто
uk: порожньо

source: Jan
ru: Янв
uk: Січ

source: Feb
ru: Фев
uk: Лют

source: Mar
ru: Мар
uk: Бер

source: Apr
ru: Апр
uk: Кві

source: May
ru: Май
uk: Тра

source: Jun
ru: Июн
uk: Чер

source: Jul
ru: Июл
uk: Лип

source: Aug
ru: Авг
uk: Сер

source: Sep
ru: Сен
uk: Вер

source: Oct
ru: Окт
uk: Жов

source: Nov
ru: Ноя
uk: Лис

source: Dec
ru: Дек
uk: Гру

source: Invalid key pressed while entering a grade: %s
ru: Нажата неверная клавиша во время ввода оценки: %s
uk: Натиснена невірна клавіша під час вводу оцінки: %s

source: Num lock appears to be turned off.
ru: Num Lock, кажется, был отключен.
uk: Num Lock, здається, був вимкнений.

source: Hit tab to change to the grade column.
ru: Нажмите клавишу Tab чтобы изменить колонку оценки.
uk: Натисніть клавішу Tab щоб змінити колонку оцінки.

source: There is no file open, or the roster is empty.
ru: Нет открытого файла или реестр пуст.
uk: Немає відкритого файлу або реєстр порожній.

source: There is nothing in the keyboard selection left to delete.
ru: В выделении клавиатурой не осталось ничего для удаления.
uk: У виділенні клавіятурою не залишилося нічого для вилучення.

source: Key not recognized: %s
ru: Клавиша не опознана: %s
uk: Клавіша не розпізнана: %s

source: No student's name begins with %s
ru: Нет имени студента, начинающегося с %s
uk: Немає ім’я студента, що починається з %s

source: The digital watermark is not consistent with this password. This is probably because you typed the password incorrectly. If you're certain you typed the password correctly, then the file has been altered by someone (perhaps you, perhaps someone else) who did not authenticate the alterations using your password; in this situation, you should click on the View Report button and see what lines were changed. See the documentation for suggestions on how to handle a case of apparent tampering.
ru: Цифровой водяной знак не согласуется с этим паролем. Это, вероятно, потому что вы ввели неправильный пароль. Если вы уверены, что ввели правильный пароль, то файл был изменён кем-то (возможно вами, возможно кем-то ещё), кто не авторизовался для изменений, используя свой пароль; в этой ситуации, вы должны щёлкнуть на кнопку Просмотра отчёта и посмотреть какие строки были изменены. Смотрите документацию для рекомендаций о том, как вести дело с явным взломом.
uk: Цифровий водяний знак не узгоджується з цим паролем. Це, ймовірно, тому що Ви увели неправильний пароль. Якщо Ви впевнені, що увели правильний пароль, то файл був змінений кимось (можливо Вами, можливо кимось ще), хто не автентифікувався для змін, використовуючи свій пароль; у цій ситуації, Ви повинні клацнути на кнопку Перегляду звіту й подивитися які рядки були змінені. Дивіться документацію для порад про те, як вести справу з явним несанкціонованим змінюванням.

source: OK
ru: ОК
uk: ТАК

source: View Report
ru: Просмотр отчёта
uk: Переглянути звіт

source: An autosave file, %s, exists. This may happen, for instance, if your computer crashes while OpenGrade has a file open. You should probably hit Cancel, get out of OpenGrade, and see if the autosave file really has different data in it than the original file. If you click on OK to open the file, your autosave file will be deleted.
ru: Существует автосохранённый файл %s. Это может произойти, например, если ваш компьютер завис, в то время как в OpenGrade был открыт файл. Вам, вероятно, следует нажать на Отмену, выйти из OpenGrade и посмотреть, действительно ли в автосохранённом файле имеются отличные от оригинального файла данные. Если вы нажмёте на кнопку ОК для открытия файла, то ваш автосохранённый файл будет удалён.
uk: Існує автозбережений файл %s. Це може статися, наприклад, якщо Ваш комп’ютер завис, у той час як в OpenGrade був відкритий файл. Вам, ймовірно, слід натиснути на Скасувати, вийти із OpenGrade й подивитися, чи справді у автозбереженому файлі є дані, що відрізняються від оригінального файлу. Якщо Ви натиснете на кнопку ТАК для відкриття файлу, то Ваш автозбережений файл буде вилучений.

source: grade
ru: оценка
uk: оцінка

source: overall
ru: в целом
uk: загалом

source: Revert all changes, are you sure?
ru: Вернуть все изменения, вы уверены?
uk: Повернути усі зміни, Ви впевнені?

source: no file open
ru: нет открытого файла
uk: немає відкритого файлу

source: modified, and not saved yet
ru: изменён, но ещё не сохранён
uk: змінений, але ще не збережений

source: saved
ru: сохранён
uk: збережений

source: The file %s has been saved.
ru: Файл %s был сохранён.
uk: Файл %s був збережений.

source: Save As
ru: Сохранить как
uk: Зберегти як

source: There was an error opening the file %s for output.
ru: Случилась ошибка при открытии файла %s для вывода.
uk: Сталася помилка при відкритті файлу %s для виводу.

source: Can't save on top of a gradebook file.
ru: Не удалось сохранить в верх файла журнала успеваемости.
uk: Не вдалося зберегти в верх файлу журналу успішности.

source: Save
ru: Сохранить
uk: Зберегти

source: Open in an Editor
ru: Открыть в редакторе
uk: Відкрити у редакторі

source: Print
ru: Печать
uk: Друк

source: You have not specified a unix shell command to use for opening a file in an editor. See the Preferences menu.
ru: Вы не указали команду оболочки unix, которую использовать для открытия файла в редакторе. Смотрите меню Настроек.
uk: Ви не вказали команду оболонки unix, яку використовувати для відкриття файлу у редакторі. Дивіться меню Налаштувань.

source: You have not specified a unix shell command to use for printing a file. See the Preferences menu.
ru: Вы не указали команду оболочки unix, которую использовать для печати файла. Смотрите меню Настроек.
uk: Ви не вказали команду оболонки unix, яку використовувати для друку файлу. Дивіться меню Налаштувань.

source: Cancel
ru: Отмена
uk: Скасувати

source: Confirm
ru: Подтверждение
uk: Схвалення

source: The file %s already exists. Overwrite it?
ru: Файл %s уже существует. Перезаписать его?
uk: Файл %s вже існує. Перезаписати його?

source: Property to Edit
ru: Свойство для редактирования
uk: Ціха для редагування

source: Editing %s
ru: Редактирование %s
uk: Редагування %s

source: Edit Information for %s
ru: Редактировать информацию для %s
uk: Редагувати інформацію для %s

source: Student ID
ru: ID студента
uk: ID студента

source: Password
ru: Пароль
uk: Пароль

source: First Name
ru: Имя
uk: Ім’я

source: Last Name
ru: Фамилия
uk: Прізвище

source: New Student Property to Define
ru: Новое свойство студента для определения
uk: Нова ціха студента для визначення

source: Value of Newly Defined Property for This Student
ru: Значение свежеопределённого свойства для этого студента
uk: Значення щойновизначеної ціхи для цього студента

source: You must define a name for the new student property you're defining.
ru: Вы должны определить имя для нового свойства студента, которое вы определяете.
uk: Ви повинні визначити ім’я для нової ціхи студента, яке Ви визначаєте.

source: Delete %s?
ru: Удалить %s?
uk: Вилучити %s?

source: Due Date
ru: Срок
uk: Термін

source: Long Name
ru: Длинное имя
uk: Довге ім’я

source: Short Name
ru: Короткое имя
uk: Коротке ім’я

source: Maximum Score
ru: Максимальный балл
uk: Максимальна оцінка

source: Ignored
ru: Проигнорировано
uk: Знехтувано

source: Marking Period
ru: Маркировка периода
uk: Маркування періоду

source: Drop %s?
ru: Вычеркнуть %s?
uk: Викреслити %s?

source: last name
ru: фамилия
uk: прізвище

source: first name
ru: имя
uk: ім’я

source: id (optional)
ru: id (опционально)
uk: id (опційно)

source: password (optional, defaults to id)
ru: пароль (опционально, дефолтно для id)
uk: пароль (опційно, типово для id)

source: Add Students
ru: Добавить студентов
uk: Додати студентів

source: Reinstate Student
ru: Восстановить студента
uk: Відновити студента

source: Add
ru: Добавить
uk: Додати

source: Done
ru: Завершить
uk: Завершити

source: %s already exists. You may have dropped this student, in which case you can reinstate her/him.
ru: %s уже существует. Вы, возможно, уже вычеркнули этого студента, в этом случае вы можете восстановить его/её.
uk: %s вже існує. Ви, можливо, вже викреслили цього студента, у цьому випадку Ви можете відновити його/її.

source: You can add as many students as you like, filling out the form and clicking on Add each time. You'll be alerted if the student already exists, or needs to be reinstated rather than added. After adding the last student, click on Add, and then when the blank form reappears, click on Done.
ru: Вы можете добавить так много студентов, как вам нравится, заполняя форму и каждый раз нажимая на Добавить. Вы будете предупреждены, если студент уже существует, или нужно его восстановить, а не добавить. После добавления последнего студента, нажмите на Добавить, а затем, когда появится пустая форма, нажмите на Завершить.
uk: Ви можете додати так багато студентів, як Вам подобається, заповнюючи форму й щораз натискаючи на Додати. Ви будете попереджені, якщо студент вже існує, або потрібно його відновити, а не додати. Після додавання останнього студента, натисніть на Додати, а потім, коли з’явиться порожня форма, натисніть на Завершити.

source: Error
ru: Ошибка
uk: Помилка

source: File
ru: Файл
uk: Файл

source: Edit
ru: Редактирование
uk: Зміни

source: New
ru: Новый
uk: Новий

source: Open...
ru: Открыть...
uk: Відкрити...

source: Close
ru: Закрыть
uk: Закрити

source: Change Password
ru: Изменить пароль
uk: Змінити пароль

source: Clear List of Recent Files
ru: Очистить список недавних файлов
uk: Очистити перелік нещодавніх файлів

source: Prevent Changes to this List
ru: Предотвратить изменения в этом списке
uk: Попередити зміни у цьому переліку

source: Quit
ru: Выход
uk: Вийти

source: Undo
ru: Отменить
uk: Скасувати

source: Undo %s
ru: Отменить %s
uk: Скасувати %s

source: Revert
ru: Вернуть
uk: Повернути

source: Students
ru: Студенты
uk: Студенти

source: Reinstate
ru: Восстановить
uk: Відновити

source: Drop %s
ru: Вычеркнуть %s
uk: Викреслити %s

source: Edit Property for Whole Class
ru: Редактировать свойство для целого класса
uk: Редагувати ціху для цілої кляси

source: Edit Information
ru: Редактировать информацию
uk: Редагувати інформацію

source: Assignments
ru: Задания
uk: Завдання

source: New Assignment
ru: Новое задание
uk: Нове завдання

source: New %s
ru: Новое %s
uk: Нове %s

source: Edit Category Weights
ru: Редактировать веса категорий
uk: Редагувати ваги категорій

source: Delete Category
ru: Удалить категорию
uk: Вилучити категорію

source: Delete Category %s
ru: Удалить категорию %s
uk: Вилучити категорію %s

source: New Category
ru: Новая категория
uk: Нова категорія

source: Edit Category Information
ru: Редактировать информацию категории
uk: Редагувати інформацію категорії

source: Edit Assignment Information
ru: Редактировать информацию задания
uk: Редагувати інформацію завдання

source: Delete Assignment
ru: Удалить задание
uk: Вилучити завдання

source: Delete %s
ru: Удалить %s
uk: Вилучити %s

source: Reports
ru: Отчёты
uk: Звіти

source: Overall Grade
ru: Оценка в целом
uk: Оцінка загалом

source: Average in %s
ru: Среднее в %s
uk: Середнє в %s

source: Average in Category
ru: Среднее в категории
uk: Середнє в категорії

source: Score on %s
ru: Баллы за %s
uk: Оцінки за %s

source: Score on Assignment
ru: Баллы за задание
uk: Оцінки за завдання

source: Spreadsheet
ru: Электронная таблица
uk: Електронна таблиця

source: Statistics for %s
ru: Статистика для %s
uk: Статистика для %s

source: Statistics for an Assignment
ru: Статистика для задания
uk: Статистика для завдання

source: Table
ru: Таблица
uk: Таблиця

source: Roster
ru: Реестр
uk: Реєстр

source: General Statistics
ru: Общая статистика
uk: Загальна статистика

source: Post Grades
ru: Разместить оценки
uk: Розмістити оцінки

source: Client/Server Settings
ru: Настройки клиента/сервера
uk: Налаштування клієнта/сервера

source: Class Description
ru: Описание класса
uk: Опис кляси

source: Disable Account of Dropped Student
ru: Отключить аккаунт вычеркнутого студента
uk: Відімкнути обліковий запис викресленого студента

source: List Work
ru: Список работ
uk: Перелік робіт

source: E-Mail List
ru: Список почты
uk: Перелік пошти

source: E-Mail for One Student
ru: Почта для одного студента
uk: Пошта для одного студента

source: Send Message
ru: Отправить сообщение
uk: Відправити повідомлення

source: Send Message to One Student
ru: Отправить сообщение одному студенту
uk: Відправити повідомлення одному студенту

source: View Messages Sent to One Student
ru: Просмотр сообщений, отправленных одному студенту
uk: Перегляд повідомлень, відправлених одному студенту

source: E-Mail for %s
ru: Почта для %s
uk: Пошта для %s

source: Send Message to %s
ru: Отправить сообщение для %s
uk: Відправити повідомлення для %s

source: View Messages Sent to %s
ru: Просмотр сообщений, отправленных для %s
uk: Перегляд повідомлень, відправлених для %s

source: Online Grades
ru: Оценки онлайн
uk: Оцінки онлайн

source: Export Grades to Online Grades Format for Uploading
ru: Экспортировать оценки в формат онлайн оценок для выгрузки
uk: Експортувати оцінки у формат онлайн оцінок для вивантаження

source: Settings
ru: Настройки
uk: Налаштування

source: Grading Standards
ru: Стандарты оценивания
uk: Стандарти оцінювання

source: Marking Periods
ru: Маркировка периодов
uk: Маркування періодів

source: Properties
ru: Свойства
uk: Ціхи

source: Clone
ru: Клонировать
uk: Клонувати

source: Export...
ru: Экспортировать...
uk: Експортувати...

source: Remove Watermark
ru: Удалить водяной знак
uk: Вилучити водяний знак

source: Reconcile
ru: Согласовать
uk: Погодити

source: Student
ru: Студент
uk: Студент

source: Preferences
ru: Параметры
uk: Параметри

source: Beeping
ru: Звуковой сигнал
uk: Звуковий сигнал

source: Left or Right Justification of Grades
ru: Левое или правое выравнивание оценок
uk: Ліве або праве вирівнювання оцінок

source: Font Size
ru: Размер шрифта
uk: Розмір шрифту

source: Command Used to Open an External Text Editor
ru: Команда, используемая для открытия внешнего текстового редактора
uk: Команда, що використовується для відкриття зовнішнього текстового редактора

source: Command Used to Print a Text File
ru: Команда, используемая для печати текстового файла
uk: Команда, що використовується для друку текстового файлу

source: Command Used to Open a Spreadsheet
ru: Команда, используемая для открытия электронной таблицы
uk: Команда, що використовується для відкриття електронної таблиці

source: Type of Digital Watermark
ru: Тип цифрового водяного знака
uk: Тип цифрового водяного знаку

source: Show Online Grades Menu
ru: Показать меню онлайн оценок
uk: Показати меню онлайн оцінок

source: Show Server Menu for Spotter
ru: Показать меню сервера для Spotter
uk: Показати меню сервера для Spotter

source: The change you've made to the menu bar will show up the next time you start OpenGrade.
ru: Изменение, которые вы сделали в меню, появятся в следующий раз, когда вы запустите OpenGrade.
uk: Зміни, які Ви зробили в меню, з’являться наступного разу, коли Ви запустите OpenGrade.

source: Help
ru: Справка
uk: Довідка

source: About OpenGrade
ru: Об OpenGrade
uk: Про OpenGrade
