Repository: bcrowell/opengrade
Catalog: i18n/*.po
Languages: ru, uk

source: to go back to the main menu.
ru: вернуться к главному меню.
uk: повернтутися до головного меню.

source: That category already exists.
ru: Такая категория уже существует.
uk: Така категорія вже існує.

source: Please enter a short name for the category, e.g., e for exams, or hw for homework. It should contain only lowercase letters from a to z. It will be used as a column header in table reports.
ru: Пожалуйста, введите краткое имя для категории, например, е для экзаменов, или hw для домашней работы. Оно должно содержать только строчные буквы от a до z. Оно будет использоваться в качестве заголовка столбца в табличных отчётах.
uk: Будь ласка, уведіть коротке ім’я для категорії, наприклад, e для іспитів, або hw для домашньої роботи. Воно повинне містити лише рядкові літери від a до z. Воно буде використовуватися у якості заголовку стовпця у табличних звітах.

source: Please enter a singular noun to describe this category. This will be combined with the names of assignments, e.g., exam+1=exam 1.
ru: Пожалуйста, введите простое существительное, чтобы описать эту категорию. Оно будет скомбинировано в сочетании с именами заданий, например, экзамен+1=экзамен 1.
uk: Будь ласка, уведіть простий іменник, щоб описати цю категорію. Він буде скомбінований у поєднанні з іменами завдань, наприклад, іспит+1=іспит 1.

source: Please enter a plural form of this noun. This will be used as a header in reports.
ru: Пожалуйста, введите форму множественного числа этого существительного. Оно будет использоваться в качестве заголовка в отчётах.
uk: Будь ласка, уведіть форму множинного числа цього іменника. Воно буде використовуватися у якості заголовку у звітах.

source: Please enter the number of assignments in this category that will be dropped, e.g. 2 if you want to ignore the lowest two scores.
ru: Пожалуйста, введите число заданий в этой категории, которые будут вычеркнуты, например 2, если вы хотите игнорировать два самых низких балла.
uk: Будь ласка, уведіть число завдань у цій категорії, які будуть викреслені, наприклад 2, якщо Ви бажаєте нехтувати дві найнижчі оцінки.

source: Type
ru: Тип
uk: Тип

source: numerical
ru: численный
uk: чисельний

source: attendance
ru: посещаемость
uk: відвідуваність

source: If this category will count toward the students' grades, just leave this blank. If it won't count, enter a period (.)
ru: Если эта категория будет считать оценки студентов, просто оставьте её пустой. Если она не будет считать, то введите период (.)
uk: Якщо ця категорія буде рахувати оцінки студентів, просто залиште її порожньою. Якщо вона не буде рахувати, то уведіть період (.)

source: Will this category will count toward the students' grades?
ru: Эта категория будет считать оценки студентов?
uk: Ця категорія буде рахувати оцінки студентів?

source: Should we normalize grades in this category (i.e., give all assignments equal weight, even if they are scored with different numbers of points)?
ru: Должны ли мы нормализовать оценки в этой категории (то есть, дать всем заданиям равный вес, даже если они набрали различное число точек)?
uk: Чи повинні ми нормалізувати оцінки у цій категорії (тобто, дати усім завданням рівну вагу, навіть якщо вони набрали різне число крапок)?

source: Will this category be ignored for purposes of computing grades?
ru: Эта категория игнорируется для целей расчёта оценок?
uk: Ця категорія нехтується для цілей розрахунку оцінок?

source: Will there only be one assignment in this category?
ru: Будет ли только одно задание в этой категории?
uk: Чи буде лише одне завдання у цій категорії?

source: Newly created assignments in this category will be ignored in the calculation of grades. Do you want to ignore all preexisting assignments as well?
ru: Свежесозданные задания в этой категории будут проигнорированы в расчёте оценок. Вы хотите игнорировать все существовавшие ранее задания тоже?
uk: Щойностворені завдання у цій категорії будуть знехтувані у розрахунку оцінок. Ви бажаєте нехтувати усі завдання, що існували раніше теж?

source: Newly created assignments in this category will be counted in the calculation of grades. Do you want to make all preexisting assignments count as well?
ru: Свежесозданные задания в этой категории будут подсчитаны в расчёте оценок. Вы хотите подсчитать все существовавшие ранее задания тоже?
uk: Щойностворені завдання у цій категорії будуть підраховані у розрахунку оцінок. Ви волієте підрахувати усі завдання, що існували раніше теж?

source: Newly created assignments in this category will have the new value for the maximum number of points. Do you want to apply this to preexisting assignments as well?
ru: Свежесозданные задания в этой категории будут иметь новое значение для максимального числа точек. Вы хотите применить это ко всем существовавшим ранее заданиям тоже?
uk: Щойностворені завдання у цій категорії будуть мати нове значення для максимального числа крапок. Ви волєте застосувати це до усіх завдань, що існували раніше теж?

source: If every assignment in this category will be worth a different number of points, leave this blank. If they will all be worth the same number of points, enter that number.
ru: Если каждое задание в этой категории будет стоить разное число точек, то оставьте это поле пустым. Если все они будут стоить такое же число точек, то введите это число.
uk: Якщо кожне завдання у цій категорії буде коштувати різне число крапок, то залиште це поле порожнім. Якщо усі вони будуть коштувати таке ж число крапок, то уведіть це число.

source: weight
ru: вес
uk: вага

source: If you want to use point-total grading for this class, leave this blank. Otherwise, enter the weight for this category.
ru: Если вы хотите использовать полностью точечное оценивание, то оставьте это пустым. В противном случае введите вес для этой категории.
uk: Якщо Ви бажаєте використовувати повністю крапкове оцінювання, то залиште це порожнім. У протилежному випадку уведіть вагу для цієї категорії.

source: Weight for this category. Leave this blank if you don't want weighted grading. Setting a weight will turn on weighted grading for this gradebook.
ru: Вес для этой категории. Оставьте это поле пустым, если вы не хотите взвешенное оценивание. Установка веса переключится на взвешенное оценивание для этого журнала успеваемости.
uk: Вага для цієї категорії. Залиште це поле порожнім, якщо Ви не бажаєте зважене оцінювання. Встановлення ваги переключиться на зважене оцінювання для цього клясного журналу.

source: Weight for this category (required, because this gradebook is using weighted grading).
ru: Вес для этой категории (требуется, потому что этот журнал успеваемости использует взвешенное оценивание).
uk: Вага для цієї категорії (потрібно, бо цей клясний журнал використовує зважене оцінювання).

source: Add this category?
ru: Добавить эту категорию?
uk: Додати цю категорію?

source: Error, couldn't find where to insert assignment.
ru: Ошибка, не удалось найти куда вставить задание.
uk: Помилка, не вдалося знайти куди вставити завдання.

source: Error, assignment %s already exists.
ru: Ошибка, задание %s уже существует.
uk: Помилка, завдання %s вже існує.

source: to add students
ru: добавить студентов
uk: додати студентів

source: to drop a student
ru: вычеркнуть студента
uk: викреслити студента

source: to reinstate a student whom you previously dropped
ru: восстановить студента, которого вы до этого вычеркнули
uk: відновити студента, якого Ви до цього викреслили

source: to return to the edit menu
ru: вернуться к меню редактирования
uk: повернутися до меню редагування

source: to return to the main menu
ru: вернуться к главному меню
uk: повернутися до головного меню

source: Last name, or return to quit
ru: Фамилия или клавиша Enter для выхода
uk: Прізвище або клавіша Enter для виходу

source: First name
ru: Имя
uk: Ім’я

source: Added %s %s.
ru: Добавлен %s %s.
uk: Доданий %s %s.

source: Dropped %s. This student can be reinstated later.
ru: Вычеркнут %s. Этот студент может быть восстановлен позже.
uk: Викреслений %s. Цей студент може бути відновлений пізніше.

source: Reinstated %s.
ru: Восстановлен %s.
uk: Відновлений %s.

source: Please enter a list, separated by commas, of the usernames of all the people who will be editing this file. If you will be the only person editing this file, then you can just hit return to accept the default username supplied below.
ru: Пожалуйста, введите список через запятую из имён пользователей из всех людей, которые будут редактировать этот файл. Если только вы будете человеком, редактирующим этот файл, то вы можете просто нажать клавишу Enter чтобы принять имя пользователя по умолчанию, обеспеченное ниже.
uk: Будь ласка, уведіть перелік через кому із імен користувачів із усіх людей, які будуть редагувати цей файл. Якщо тільки Ви будете людиною, що редагує цей файл, то Ви можете просто натиснути клавішу Enter щоб прийняти типове ім’я користувача, забезпечене нижче.

source: Please enter a list, separated by commas, of the usernames of all the people who will be editing this file. If you are using a system that doesn't have usernames, you can leave this blank.
ru: Пожалуйста, введите список через запятую из имён пользователей из всех людей, которые будут редактировать этот файл. Если вы используете систему, которая не имеет имён пользователей, то вы можете оставить это пустым.
uk: Будь ласка, уведіть перелік через кому із імен користувачів із усіх людей, які будуть редагувати цей файл. Якщо Ви використовуєте систему, яка не має імен користувачів, то Ви можете залишити це порожнім.

source: Since your system doesn't seem to support usernames, it doesn't really matter what naming convention you pick, as long as it's easy for you and your co-instructors to remember.
ru: Так как ваша система, кажется, не поддерживает имена пользователей, это действительно не имеет значения, какое именование вы выбираете, тех пор, пока это легко для вас и ваших коллег-инструкторов чтобы запоминать.
uk: Оскільки Ваша система, здається, не підтримує імена користувачів, це справді не має значення, яке йменування Ви вибираєте, доти, доки це легко для Вас та Ваших колег-інструкторів щоб запам’ятовувати.

source: Your system seems to support usernames, so it will be most convenient if you use the ones it supplies, rather than making up new ones. That way you will simply be recognized automatically when you start the software
ru: Ваша система, кажется, поддерживает имена пользователей, так что это будет наиболее удобно, если вы используете это, вместо того, чтобы создавать что-то новое. Таким образом, вы просто будете признаны автоматически, когда вы запустите программу
uk: Ваша система, здається, підтримує імена користувачів, тож це буде найзручніше, якщо Ви використаєте це, замість того, щоб створювати щось нове. Таким чином, Ви просто будете розпізнані автоматично, коли Ви запустите проґраму

source: Please enter the days of the week on which the class meets, using R for Thursday, and U for Sunday. Supplying accurate information here will make it quicker for you to enter due dates. If the class doesn't meet on definite days of the week, just leave it blank to accept the default, which is MTWRF. It's OK if you leave this blank.
ru: Пожалуйста, введите дни недели, в которые класс встречается, используя R для четверга и U для воскресенья. Указание точной информации здесь ускорит вам ввод сроков. Если класс не встречается в определённые дни недели, просто оставьте это поле пустым, чтобы принять значение по умолчанию, то есть MTWRF. Это нормально, если вы оставите это пустым.
uk: Будь ласка, уведіть дні тижня, у які кляса зустрічається, використовуючи R для четверга й U для неділі. Вказування точної інформації тут пришвидшить Вам ввід термінів. Якщо кляса не зустрічається у певні дні тижня, просто залиште це поле порожнім, щоб прийняти типове значення , тобто MTWRF. Це нормально, якщо Ви залишите це порожнім

source: Please use only the letters M, T, W, R, F, S, and U.
ru: Пожалуйста, используйте только буквы M, T, W, R, F, S и U.
uk: Будь ласка, використовуйте лише літери M, T, W, R, F, S і U.

source: Grading standards: If you don't want to set grading standards right now, just hit return. The lowest letter grade in your grading system, typically F, needs to be entered explicitly, with a minimum percentage of zero.
ru: Стандарты оценивания: Если вы не хотите устанавливать стандарты оценивания прямо сейчас, то просто нажмите клавишу Enter. Самая низкая оценка письма в вашей системе оценивания, обычно F, должна быть введена в явном виде с минимальным процентом нуля.
uk: Стандарти оцінювання: Якщо Ви не бажаєте встановлювати стандарти оцінювання прямо зараз, то просто натисніть клавішу Enter. Найнижча оцінка письма у Вашій системі оцінювання, зазвичай F, має бути уведена в явному вигляді з мінімальним відсотком нуля.

source: Enter a letter grade, or hit return if you're done.
ru: Введите оценку письма или нажмите клавишу Enter, если вы завершили.
uk: Уведіть оцінку письма або натисніть клавішу Enter, якщо Ви завершили.

source: Enter the minimum percentage required for this grade.
ru: Введите минимальный процент, необходимый для этой оценки.
uk: Уведіть мінімальний відсоток, необхідний для цієї оцінки.

source: Please enter a numerical value from 0 to 100.
ru: Пожалуйста, введите числовое значение от 0 до 100.
uk: Будь ласка, уведіть числове значення від 0 до 100.

source: The following questions relate to posting grades on the web. You can leave these blank if you won't be using this feature.
ru: Следующие вопросы относятся к размещению оценок в Интернете. Вы можете оставить это поле пустым, если вы не будете использовать эту функцию.
uk: Наступні питання відносяться до розміщення оцінок в Інтернеті. Ви можете залишити це поле порожнім, якщо Ви не будете використовувати цю функцію.

source: Please enter the FTP username you'll use for uploading web reports.
ru: Пожалуйста, введите имя пользователя FTP, которое вы будете использовать для выгрузки веб-отчётов.
uk: Будь ласка, уведіть ім’я користувача FTP, яке Ви будете використовувати для вивантаження веб-звітів.

source: Please enter the name of the FTP server to which you'll upload web reports, e.g., myserver.edu.
ru: Пожалуйста, введите имя FTP сервера, куда вы будете выгружать веб-отчёты, например, myserver.edu.
uk: Будь ласка, уведіть ім’я FTP сервера, куди Ви будете відвантажувати веб-звіти, наприклад myserver.edu.

source: Please enter the subdirectory for web reports, relative to cgi-bin. This directory should exist before you upload grades.
ru: Пожалуйста, введите подкаталог для веб-отчётов, привязанный к cgi-bin. Этот каталог должен существовать до вашей выгрузки оценок.
uk: Будь ласка, уведіть підкаталог для веб-звітів, прив’язаний до cgi-bin. Цей каталог повинен існувати до Вашого вивантаження оцінок.

source: Please enter the name of the file to create.
ru: Пожалуйста, введите имя файла, чтобы создать его.
uk: Будь ласка, уведіть ім’я файлу, щоб створити його.

source: Your new gradebook has been created. You will probably want to choose 'e' from the main menu to input your assignment categories and the names of the students, and then 's' to save the file.
ru: Ваш новый журнал успеваемости был создан. Вы, вероятно, хотите выбрать 'e' из главного меню чтобы ввести свои категории заданий и имена студентов, а затем 's' чтобы сохранить файл.
uk: Ваш новий клясний журнал створено. Ви, ймовірно, волієте вибрати 'e' із головного меню щоб увести свої категорії завдань та імена студентів, а потім 's' щоб зберегти файл.

source: Enter password
ru: Введите пароль
uk: Уведіть пароль

source: Reports menu --- enter
ru: Меню отчётов --- ввод
uk: Меню звітів --- ввід

source: to view class totals
ru: смотреть итоги класса
uk: дивитися підсумки кляси

source: to view a report for one student
ru: смотреть отчёт для одного студента
uk: дивитися звіт для одного студента

source: to view a report on one assignment for the whole class
ru: смотреть отчёт для одного задания для целого класса
uk: дивитися звіт для одного завдання для цілої кляси

source: to create web reports
ru: создать веб-отчёты
uk: створити веб-звіти

source: to see statistics
ru: смотреть статистику
uk: дивитися статистику

source: Please make sure you have an active internet connection.
ru: Пожалуйста, убедитесь, что у вас есть активное подключение к Интернету.
uk: Будь ласка, переконайтеся, що в Вас є активне з’єднання з Інтернет.

source: server
ru: сервер
uk: сервер

source: dir
ru: каталог
uk: каталог

source: backup
ru: резервная копия
uk: резервна копія

source: username
ru: имя пользователя
uk: ім’я користувача

source: Enter ftp password for %s
ru: Введите пароль ftp для %s
uk: Уведіть пароль ftp для %s

source: All files were uploaded successfully.
ru: Все файлы были успешно выгружены.
uk: Усі файли були успішно вивантажені.

source: Enter the beginning of the student's last name
ru: Введите начальные буквы фамилии студента
uk: Уведіть початкові літери прізвища студента

source: No students have last names beginning with
ru: Нет студентов, фамилии которых начинаются с
uk: Немає студентів, прізвища яких починаються з

source: Enter the short name of the assignment.
ru: Введите короткое имя задания.
uk: Уведіть коротке ім’я завдання.

source: Create new assignment
ru: Создать новое задание
uk: Створити нове завдання

source: Enter the beginning of the category's name
ru: Введите начальные буквы имени категории
uk: Уведіть початкові літери ім’я категорії

source: No categories have names beginning with
ru: Нет категорий, имена которых начинаются с
uk: Немає категорій, імена яких починаються з

source: You must create categories first.
ru: Сначала вы должны создать категории.
uk: Спочатку Ви повинні створити категорії.

source: Entering grades for an assignment:
ru: Ввод оценок для задания:
uk: Ввід оцінок для завдання:

source: No such category
ru: Такой категории нет
uk: Такої категорії немає

source: To add this new assignment to the end of the list of assignments for this category, type return. If you don't want to create it, type a period (.). If you want to add it before the end of the list, enter the beginning of the name of the assignment before which you want to insert it.
ru: Чтобы добавить новое задание в конец списка заданий для этой категории, введите клавишой Enter. Если вы не хотите создавать его, то введите период (.). Если вы хотите добавить его до конца списка, введите начало имени задания, перед которым вы хотите вставить его.
uk: Щоб додати нове завдання у кінець переліку завдань для цієї категорії, уведіть клавішою Enter. Якщо Ви не бажаєте створювати його, то уведіть період (.). Якщо Ви волієте додати його до кінця переліку, уведіть початок ім’я завдання, перед яким Ви бажаєте вставити його.

source: Action canceled.
ru: Действие отменено.
uk: Дію скасовано.

source: maximum score
ru: максимальный балл
uk: максимальна оцінка

source: The maximum score possible.
ru: Возможный максимальный балл.
uk: Можлива максимальна оцінка.

source: due date, in mm-dd format (optional)
ru: Срок в формате мм-дд (опционально)
uk: Термін у форматі мм-дд (опційно)

source: The date when the assignment is due.
ru: Дата, на которую намечено задание.
uk: Дата, на яку намічено завдання

source: The maximum score is %s.
ru: Максимальный балл %s.
uk: Максимальна оцінка %s.

source: Enter a grade for each student, or press return to leave it as it is. Type q to quit before the end of the list, c to cancel, up arrow to back up to the previous student, and b to change a preexisting grade to a blank.
ru: Введите оценку для каждого студента или нажмите клавишу Enter, чтобы оставить всё как есть. Введите q чтобы выйти перед концом списка, латинскую c для отмены, стрелку вверх чтобы создать резервную копию предыдущего студента и b чтобы изменить уже существующую оценку на пустую.
uk: Уведіть оцінку для кожного студента або натисніть клавішу Enter, щоб залишити усе як є. Уведіть q щоб вийти перед кінцем переліку, латинську c для скасування, стрілку вгору щоб створити резервну копію попереднього студента і b щоб змінити вже існуючу оцінку на порожню.

source: When you're done entering grades, hit return instead of selecting a student. That is greater than the maximum score for this assignment. Hit return to confirm this score, or enter another value. Type x to leave this score unchanged.
ru: Когда вы закончите ввод оценок, нажмите клавишу Enter вместо выбора студента. Это больше, чем максимальный балл для этого задания. Нажмите ввод, чтобы подтвердить этот балл, или введите другое значение. Введите х, чтобы оставить этот балл без изменений.
uk: Коли Ви закінчите ввід оцінок, натисніть клавішу Enter замість вибору студента. Це більше, ніж максимальна оцінка для цього завдання. Натисніть ввід, щоб підтвердити цю оцінку, або уведіть інше значення. Уведіть х, щоб залишити цю оцінку без змін.

source: That is greater than the maximum score for this assignment. Hit return to confirm this score, or enter another value. Type x to leave this score unchanged.
ru: Это больше, чем максимальный балл для этого задания. Нажмите клавишу Enter, чтобы подтвердить этот балл, или введите другое значение. Введите х, чтобы оставить этот балл без изменений.
uk: Це більше, ніж максимальна оцінка для цього завдання. Натисніть клавішу Enter, щоб підтвердити цю оцінку, або уведіть інше значення. Уведіть х, щоб залишити цю оцінку без змін.

source: Invalid input.
ru: Недопустимый ввод.
uk: Неприпустимий ввід.

source: Spotter
uk: Коригувальник
